package com.cdoframework.cdolib.framework;

import java.util.Properties;

import com.cdoframework.cdolib.base.PropertiesExt;
import com.cdoframework.cdolib.base.Return;


/**
 * @author Frank
 */
public abstract class App extends PropertiesExt
{

	//静态对象,所有static在此声明并初始化------------------------------------------------------------------------

	//内部对象,所有在本类中创建并使用的对象在此声明--------------------------------------------------------------

	//属性对象,所有在本类中创建，并允许外部访问的对象在此声明并提供get/set方法-----------------------------------
	public Properties getProperties(){return properties;}

	//引用对象,所有在外部创建并传入使用的对象在此声明并提供set方法-----------------------------------------------

	//内部方法,所有仅在本类或派生类中使用的函数在此定义为protected方法-------------------------------------------

	//公共方法,所有可提供外部使用的函数在此定义为public方法------------------------------------------------------
	
	/**
	 * 启动应用程序
	 * @param args 命令行参数
	 * @return 启动结果
	 */
	public abstract Return start();
	
	/**
	 * 停止应用程序
	 *
	 */
	public abstract void stop();

	/**
	 * 退出当前的Java应用程序
	 *
	 */
	static public void exit()
	{
		Runtime.getRuntime().exit(0);
	}
	//接口实现,所有实现接口函数的实现在此定义--------------------------------------------------------------------

	//事件处理,所有重载派生类的事件类方法(一般为on...ed)在此定义-------------------------------------------------

	//事件定义,所有在本类中定义并调用，由派生类实现或重载的事件类方法(一般为on...ed)在此定义---------------------

	//构造函数,所有构造函数在此定义------------------------------------------------------------------------------

	public App()
	{
		super();

		//请在此加入初始化代码,内部对象和属性对象负责创建或赋初值,引用对象初始化为null，初始化完成后在设置各对象之间的关系
	}

}
